In [1]:
import pandas as pd

Nbaplayers_file=pd.read_csv(r'C:\Users\priyalakshmi\Desktop\PyFE\priyalakshmi01\nba.csv')#reading csv file using read_csv()

Nbaplayers_file.head()#To display first 5 rows of a file

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [4]:
Nbaplayers_file.shape#To display dimension of the table i.e total number of column & rows

(458, 9)

In [6]:
Nbaplayers_file.shape[0]#To display the number of rows

458

In [7]:
Nbaplayers_file.shape[1]#To dispolay the number of columns

9

In [8]:
table = pd.DataFrame(Nbaplayers_file, columns = ['Team', 'Number','salary','Height'])#Creating dataframe of columns
display(table.dtypes)#To display the datatypes of dataframe

Team       object
Number    float64
salary    float64
Height     object
dtype: object

In [9]:
include =['object','float', 'int'] #List of datatypes needs to be included to statistics
des = Nbaplayers_file.describe(include = include) #Creating dataframe using describe() method
des #shows statistics of the datatypes included in above lines

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,457,457.000000,457,457.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,102,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.938731,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.404016,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
25%,NaN,NaN,5.000000,NaN,24.000000,NaN,200.000000,NaN,1.044792e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
75%,NaN,NaN,25.000000,NaN,30.000000,NaN,240.000000,NaN,6.500000e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

In [10]:
Nbaplayers_file['Name'].describe()#shows statistics of Name column

count               457
unique              457
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [11]:
Nbaplayers_file.median()# shows the median of dataframe

C:\Users\priyalakshmi\AppData\Local\Temp\ipykernel_16556\3174800417.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  Nbaplayers_file.median()# shows the median of dataframe

Number         13.0
Age            26.0
Weight        220.0
Salary    2839073.0
dtype: float64

In [12]:
Nbaplayers_file['Age'].median()#shows the median of age

26.0